.emacs.d/readme.org
#+Title: VeggieMacs
#+AUTHOR: Solomon Bothwell and Reed Mullanix and AcidBurn
#+PROPERTY: header-args :tangle yes :results silent
#+TOC: true* Setup
#+STARTUP: fold

This emacs config is based on Reed's config.

* Setup
** Package Management
   First, let’s load up some basic bootstrap code for straight.el.
   #+BEGIN_SRC emacs-lisp
   (defvar bootstrap-version)
   (let ((bootstrap-file
   (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
   (bootstrap-version 5))
   (unless (file-exists-p bootstrap-file)
   (with-current-buffer
   (url-retrieve-synchronously
   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
   'silent 'inhibit-cookies)
   (goto-char (point-max))
   (eval-print-last-sexp)))
   (load bootstrap-file nil 'nomessage))
   #+END_SRC

   Now, let’s load up use-package.
   #+BEGIN_SRC emacs-lisp
   (straight-use-package 'use-package)
   #+END_SRC

** Restarting Emacs
   Let’s install restart-emacs.
   #+BEGIN_SRC emacs-lisp
   (use-package restart-emacs
     :straight t
     :commands (restart-emacs))
   #+END_SRC

** Avoid GC during initialization.
   By default, the GC threshold for emacs is 800kb, so let’s bump this up to 10MB to avoid GC when initializing.
   #+BEGIN_SRC emacs-lisp
   (setq gc-cons-threshold 10000000)

   ;; Restore after startup
   (add-hook 'after-init-hook
             (lambda ()
               (setq gc-cons-threshold 1000000)
               (message "gc-cons-threshold restored to %S"
                        gc-cons-threshold)))
   #+END_SRC

** Figuring out errors
   Let's install [[https://github.com/Malabarba/elisp-bug-hunter][bug-hunter]] so that we
   can bisect our config and track down annoying
   behavior.
   #+BEGIN_SRC emacs-lisp
     (use-package bug-hunter
       :straight t)
   #+END_SRC

** Binding Keys
   Let's use [[https://github.com/noctuid/general.el][general.el]] to bind our keys in a more consistent way.
   #+BEGIN_SRC emacs-lisp  :results silent
     (use-package general
       :straight t
       :config
       (general-evil-setup)
       (general-auto-unbind-keys))
   #+END_SRC

* Preferences
  Don't show the help screen on startup.
  #+BEGIN_SRC emacs-lisp
    (setq inhibit-startup-screen t)
  #+END_SRC

  Let's disable some un-needed window decorations.
  #+BEGIN_SRC emacs-lisp
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (menu-bar-mode -1)
  #+END_SRC

  The error bell is really obnoxious, so let's just turn it off.
  #+BEGIN_SRC emacs-lisp
    (setq ring-bell-function 'ignore)
  #+END_SRC

  Don't fill the filesystem with garbage please.
  #+BEGIN_SRC emacs-lisp
    (setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t))
          backup-by-copying t
          backup-directory-alist '((".*" . "~/.emacs-tmp"))
          delete-old-versions t
          kept-new-versions 6
          kept-old-versions 2
          version-control t)
  #+END_SRC

  Never, ever use tabs.
  #+BEGIN_SRC emacs-lisp
    (add-hook 'prog-mode-hook (lambda ()
                                (setq indent-tabs-mode nil)
                                (setq-default tab-width 2)
                                ))
  #+END_SRC

  Make 'yes or no' prompts shorter.
  #+BEGIN_SRC emacs-lisp
    (defalias 'yes-or-no-p 'y-or-n-p)
  #+END_SRC


  For whatever reason, adding things to ~exec-path~ can be a bit wonky, so let's define
  a helper for doing just that.
  #+BEGIN_SRC emacs-lisp
    (defun add-to-path (path)
      (add-to-list 'exec-path path)
      (setenv "PATH" (concat path ":" (getenv "PATH"))))
  #+END_SRC

  A lot of our commands live inside of ~/usr/local/bin~, so let's load it up!
  #+BEGIN_SRC emacs-lisp
    (add-to-path "/usr/local/bin/")
  #+END_SRC

  Make sure to follow symlinks
  #+BEGIN_SRC emacs-lisp
    (setq vc-follow-symlinks t)
  #+END_SRC

  Highlight matching parens
  #+BEGIN_SRC emacs-lisp
    (show-paren-mode)
  #+END_SRC

  Highlight between point and selection start.
  #+BEGIN_SRC emacs-lisp
    (transient-mark-mode)
  #+END_SRC

  Fix scrolling
  #+BEGIN_SRC emacs-lisp
    (setq scroll-conservatively 101
          mouse-wheel-scroll-amount '(1)
          mouse-wheel-progressive-speed nil)
  #+END_SRC

  Avoid calling =line-move-partial=, increasing scroll speed.
  See [[https://emacs.stackexchange.com/questions/28736/emacs-pointcursor-movement-lag/28746][this]] for a more in-depth explanation.
  #+BEGIN_SRC emacs-lisp
    (setq auto-window-vscroll nil)
  #+END_SRC

  Add line numbers to all programming modes
  #+BEGIN_SRC emacs-lisp
    (add-hook 'prog-mode-hook 'linum-mode 'smartparens-mode)
  #+END_SRC

  Add smart parens to all programming modes
  #+BEGIN_SRC emacs-lisp
    (add-hook 'prog-mode-hook 'smartparens-mode)
  #+END_SRC

  Set global font size
  #+BEGIN_SRC emacs-lisp
    (set-face-attribute 'default nil :height 130)
  #+END_SRC
* Themes
  There are a few options here, as I haven't totally settled.
  #+BEGIN_SRC emacs-lisp
    (use-package color-theme-sanityinc-tomorrow
      :straight t
      :config
      (load-theme 'sanityinc-tomorrow-eighties t))
  #+END_SRC

* Interface
** Modeline
   Let's add =diminish= so that we can easily theme the modeline.
   #+BEGIN_SRC emacs-lisp
     (use-package diminish
       :straight t)
   #+END_SRC

   Next, let's add some helpful indicators.
   #+BEGIN_SRC emacs-lisp
     (display-time-mode 1)
     (display-battery-mode 1)
     (column-number-mode 1)
   #+END_SRC

   I also rather like =smart-mode-line=, so let's install that.
   #+BEGIN_SRC emacs-lisp
     (use-package smart-mode-line
       :straight t
       :init
       (setq sml/theme nil)
       (add-hook 'after-init-hook 'sml/setup))
   #+END_SRC
** Which Key
   First, let's add [[https://github.com/justbur/emacs-which-key][which-key]].
   #+BEGIN_SRC emacs-lisp
     (use-package which-key
       :diminish which-key-mode
       :straight t)
     (which-key-mode)
   #+END_SRC

   To enable custom prefix names, we need to set =which-key-enable-extended-define-key=.
   #+BEGIN_SRC emacs-lisp
     (setq which-key-enable-extended-define-key t)
   #+END_SRC

   Finally, lets enable =which-key-mode=.
   #+BEGIN_SRC emacs-lisp
     (which-key-mode 1)
   #+END_SRC

** Evil
   [[https://github.com/emacs-evil/evil][evil]] provides us with vim-like keybindings inside of emacs.

   #+BEGIN_SRC emacs-lisp  :results silent

     (use-package evil
       :straight t
       :init
       (setq evil-want-keybinding nil)
       (setq evil-want-C-u-scroll t)
       :config
       (evil-mode 1)
       :after (general)
       :general
       (general-mmap ";" 'evil-ex))
   #+END_SRC

   Let's also install [[https://github.com/emacs-evil/evil-surround][evil-surround]], which lets us wrap a selection.

   #+BEGIN_SRC emacs-lisp
     ;(use-package evil-surround
     ;  :straight t
     ;  :config
     ;  (global-evil-surround-mode 1))

     (use-package smartparens
       :straight t)
   #+END_SRC

   Now, when we are in visual-state, we can suround our selection by
   using =S=.

   Finally, let's install [[https://github.com/emacs-evil/evil-collection][evil-collection]].

   #+BEGIN_SRC emacs-lisp
     (use-package evil-collection
       :straight t
       :after evil
       :config
       (setq evil-collection-mode-list nil)
       (evil-collection-init 'calc)
       (evil-collection-init 'cider)
       (evil-collection-init 'compile)
       (evil-collection-init 'custom)
       (evil-collection-init 'dired)
       (evil-collection-init 'ediff)
       (evil-collection-init 'elfeed))
       (evil-collection-init 'flycheck)
       (evil-collection-init 'flymake)
       (evil-collection-init 'geiser)
       (evil-collection-init 'helpful)
       (evil-collection-init 'info)
       (evil-collection-init 'profiler)
       (evil-collection-init 'sly)
       (evil-collection-init 'tablist)
       (evil-collection-init 'vterm)
       (evil-collection-init 'xref)
   #+END_SRC

*** Keybindings
    To begin, let's use =general.el= to create a base "definer".
    This starts everything with a =SPC= prefix, and sticks
    it in the =general-override-mode-map= map, which overrides
    other keybindings.

    #+BEGIN_SRC emacs-lisp
      (general-create-definer global-definer
        :keymaps 'override
        :states '(insert emacs normal hybrid motion visual operator)
        :prefix "SPC"
        :non-normal-prefix "C-SPC")
    #+END_SRC

    Because we have mapped =C-u= to scrolling (as in vim), we can't do
    ~universal-argument~. To fix this, let's bind a key to that.

    #+BEGIN_SRC emacs-lisp
      (defun better-universal-argument ()
        (interactive)
        (if current-prefix-arg
            (universal-argument-more current-prefix-arg)
          (universal-argument)))

      (global-definer
        "u" '(better-universal-argument :wk "universal"))
    #+END_SRC

    Next, let's create a macro that makes definers for each nested prefix maps.
    This lets us re-use each defininer, and prevent clobbering of definitions.

    #+BEGIN_SRC emacs-lisp
      (defmacro general-global-menu-definer (def infix-key &rest body)
        "Create a definer named general-global-DEF wrapping global-definer.
      The prefix map is named 'my-DEF-map'."
        (let ((definer-name (intern (concat "general-global-" def))))
          (if (fboundp definer-name)
              `(,definer-name ,@body)
            `(progn
               (general-create-definer ,definer-name
                 :wrapping global-definer
                 :prefix-map ',(intern (concat "my-" def "-map"))
                 :infix ,infix-key
                 :wk-full-keys nil
                 "" '(:ignore t :which-key ,def))
               (,definer-name
                 ,@body)))))
    #+END_SRC

    #+BEGIN_SRC emacs-lisp
      (general-create-definer general-global-motion-definer
        :keymaps 'override
        :states '(normal motion visual operator)
        :prefix "g")
    #+END_SRC

    Now, let's also make a quick helper for adding mode-specific motions.

    #+BEGIN_SRC emacs-lisp
      (general-create-definer general-local-motion-definer
        :states 'normal
        :keymaps 'override
        :prefix "g")
    #+END_SRC

    We also need a mode-specific local leader.

    #+BEGIN_SRC emacs-lisp
      (define-key evil-motion-state-map "," nil)

      (general-create-definer general-mode-leader-definer
        :states '(normal motion)
        :wrapping global-definer
        :prefix ","
        "" '(:ignore t :which-key "mode"))
    #+END_SRC

    evil-commands shadows the `q` key with `evil-record-macro`. I don't
    use vim macros so lets disable it.
    #+BEGIN_SRC emacs-lisp
      (general-def evil-normal-state-map "q" 'nil)
    #+END_SRC
