.emacs.d/readme.el
(defvar bootstrap-version)
(let ((bootstrap-file
(expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
(bootstrap-version 5))
(unless (file-exists-p bootstrap-file)
(with-current-buffer
(url-retrieve-synchronously
"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
'silent 'inhibit-cookies)
(goto-char (point-max))
(eval-print-last-sexp)))
(load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(use-package restart-emacs
  :straight t
  :commands (restart-emacs))

(setq gc-cons-threshold 10000000)

;; Restore after startup
(add-hook 'after-init-hook
          (lambda ()
            (setq gc-cons-threshold 1000000)
            (message "gc-cons-threshold restored to %S"
                     gc-cons-threshold)))

(use-package bug-hunter
  :straight t)

(use-package general
  :straight t
  :config
  (general-evil-setup)
  (general-auto-unbind-keys))

(setq inhibit-startup-screen t)

(tool-bar-mode -1)
(scroll-bar-mode -1)
(menu-bar-mode -1)

(setq ring-bell-function 'ignore)

(setq auto-save-file-name-transforms `((".*" ,temporary-file-directory t))
      backup-by-copying t
      backup-directory-alist '((".*" . "~/.emacs-tmp"))
      delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)

(add-hook 'prog-mode-hook (lambda ()
                            (setq indent-tabs-mode nil)
                            (setq-default tab-width 2)
                            ))

(defalias 'yes-or-no-p 'y-or-n-p)

(defun add-to-path (path)
  (add-to-list 'exec-path path)
  (setenv "PATH" (concat path ":" (getenv "PATH"))))

(add-to-path "/usr/local/bin/")

(setq vc-follow-symlinks t)

(show-paren-mode)

(transient-mark-mode)

(setq scroll-conservatively 101
      mouse-wheel-scroll-amount '(1)
      mouse-wheel-progressive-speed nil)

(setq auto-window-vscroll nil)

(add-hook 'prog-mode-hook 'linum-mode 'smartparens-mode)

(add-hook 'prog-mode-hook 'smartparens-mode)

(set-face-attribute 'default nil :height 130)

(use-package color-theme-sanityinc-tomorrow
  :straight t
  :config
  (load-theme 'sanityinc-tomorrow-eighties t))

(use-package diminish
  :straight t)

(display-time-mode 1)
(display-battery-mode 1)
(column-number-mode 1)

(use-package smart-mode-line
  :straight t
  :init
  (setq sml/theme nil)
  (add-hook 'after-init-hook 'sml/setup))

(use-package which-key
  :diminish which-key-mode
  :straight t)
(which-key-mode)

(setq which-key-enable-extended-define-key t)

(which-key-mode 1)

(use-package evil
  :straight t
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  :after (general)
  :general
  (general-mmap ";" 'evil-ex))

;(use-package evil-surround
;  :straight t
;  :config
;  (global-evil-surround-mode 1))

(use-package smartparens
  :straight t)

(use-package evil-collection
  :straight t
  :after evil
  :config
  (setq evil-collection-mode-list nil)
  (evil-collection-init 'calc)
  (evil-collection-init 'cider)
  (evil-collection-init 'compile)
  (evil-collection-init 'custom)
  (evil-collection-init 'dired)
  (evil-collection-init 'ediff)
  (evil-collection-init 'elfeed))
  (evil-collection-init 'flycheck)
  (evil-collection-init 'flymake)
  (evil-collection-init 'geiser)
  (evil-collection-init 'helpful)
  (evil-collection-init 'info)
  (evil-collection-init 'profiler)
  (evil-collection-init 'sly)
  (evil-collection-init 'tablist)
  (evil-collection-init 'vterm)
  (evil-collection-init 'xref)

(general-create-definer global-definer
  :keymaps 'override
  :states '(insert emacs normal hybrid motion visual operator)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")

(defun better-universal-argument ()
  (interactive)
  (if current-prefix-arg
      (universal-argument-more current-prefix-arg)
    (universal-argument)))

(global-definer
  "u" '(better-universal-argument :wk "universal"))

(defmacro general-global-menu-definer (def infix-key &rest body)
  "Create a definer named general-global-DEF wrapping global-definer.
The prefix map is named 'my-DEF-map'."
  (let ((definer-name (intern (concat "general-global-" def))))
    (if (fboundp definer-name)
        `(,definer-name ,@body)
      `(progn
         (general-create-definer ,definer-name
           :wrapping global-definer
           :prefix-map ',(intern (concat "my-" def "-map"))
           :infix ,infix-key
           :wk-full-keys nil
           "" '(:ignore t :which-key ,def))
         (,definer-name
           ,@body)))))

(general-create-definer general-global-motion-definer
  :keymaps 'override
  :states '(normal motion visual operator)
  :prefix "g")

(general-create-definer general-local-motion-definer
  :states 'normal
  :keymaps 'override
  :prefix "g")

(define-key evil-motion-state-map "," nil)

(general-create-definer general-mode-leader-definer
  :states '(normal motion)
  :wrapping global-definer
  :prefix ","
  "" '(:ignore t :which-key "mode"))

(general-def evil-normal-state-map "q" 'nil)

(use-package ivy
  :straight t
