.emacs.d/readme.el
  :diminish ivy-mode
  :init
  (setq ivy-use-selectable-prompt t)
  (setq ivy-re-builders-alist
        '((counsel-rg . ivy--regex-plus)
          (swiper . ivy--regex-plus)
          (t . ivy--regex-ignore-order)))
  (ivy-mode 1)
  :config
  :general

  (general-mmap "/" 'swiper))

(use-package counsel
  :straight t
  :diminish counsel-mode
  :config
  (counsel-mode 1)
  (setq ivy-initial-inputs-alist nil)
  :general
  ("M-x" 'counsel-M-x)
  (global-definer "SPC" '(counsel-M-x :wk "M-x")))

(use-package hydra
  :straight t)


(use-package ivy-hydra
  :straight t
  :after (ivy hydra))

(global-definer
 "i" '(counsel-imenu :wk "imenu"))

(use-package helpful
  :straight t
  :config
  (setq counsel-describe-function-function #'helpful-callable)
  (setq counsel-describe-variable-function #'helpful-variable))

(general-global-menu-definer "help" "h"
                             "i" '(info                      :wk "info")
                             "D" '(toggle-debug-on-error     :wk "toggle debugger"))
(general-global-menu-definer "describe" "h d"
                             "b" '(describe-bindings         :wk "describe bindings")
                             "F" '(counsel-faces             :wk "describe face")
                             "f" '(counsel-describe-function :wk "describe function")
                             "k" '(describe-key              :wk "describe key")
                             "v" '(counsel-describe-variable :wk "describe variable")
                             "m" '(describe-mode             :wk "describe mode")
                             "p" '(describe-package          :wk "describe package")
                             "'" '(describe-char             :wk "describe char"))

(defun open-scratch-buffer ()
  (interactive)
  (display-buffer (get-buffer-create "*scratch*")))

(general-global-menu-definer "buffer" "b"
                             "b" '(counsel-switch-buffer          :wk "switch buffer")
                             "c" '(compile                        :wk "compile")
                             "d" '(kill-current-buffer            :wk "kill buffer")
                             "r" '(rename-buffer                  :wk "rename buffer")
                             "F" '(font-lock-fontify-buffer       :wk "fontify buffer")
                             "N" '(evil-buffer-new                :wk "new buffer")
                             "n" '(next-buffer                    :wk "next-buffer")
                             "p" '(previous-buffer                :wk "previous-buffer")
                             "s" '(open-scratch-buffer            :wk "switch to scratch buffer")
                             "x" '(kill-buffer-and-window         :wk "kill-buffer-and-window"))

(global-definer
  ;"," '(counsel-switch-buffer :wk "switch buffer")
  "x" '(open-scratch-buffer   :wk "scratch buffer"))

(defun open-config-file ()
  (interactive)
  (find-file "~/.emacs.d/readme.org"))

(defun compile-config-file ()
  (interactive)
   (org-babel-tangle-file "~/.emacs.d/readme.org")
   (load-file "~/.emacs.d/init.el"))

(defun open-private-config-file ()
  (interactive)
  (find-file "~/.emacs.d/private.org"))

(defun open-straight-repo ()
  (interactive)
  (counsel-find-file "~/.emacs.d/straight/repos/"))

(defun open-nixos-config ()
  (interactive)
  (find-file "/sudo::/etc/nixos/configuration.nix"))

(defun open-xmonad-config ()
  (interactive)
  (find-file "~/.xmonad/xmonad.hs"))

(defun open-xmobar-config ()
  (interactive)
  (find-file "~/.xmobarrc"))

(general-global-menu-definer "file" "f"
                             "f" '(counsel-find-file        :wk "find file")
                             "r" '(counsel-recentf          :wk "recent files")
                             "s" '(save-buffer              :wk "save buffer")
                             "I" '(open-private-config-file :wk "private config file"))

(global-definer
"." '(counsel-find-file :wk "find file"))

(general-global-menu-definer "configs" "f e"
                             "c" '(open-nixos-config   :wk "configuration.nix")
                             "d" '(open-config-file    :wk "emacs")
                             "R" '(compile-config-file :wk "compile emacs config")
                             "x" '(open-xmonad-config  :wk "xmonad")
                             "X" '(open-xmobar-config  :wk "xmobar"))

(defun open-notebook ()
  (interactive)
  (find-file "~/.org/notebook.gpg"))

(general-global-menu-definer "documents" "f d"
                             "n" '(open-notebook :wk "notebook"))

(use-package ace-window
  :straight t
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (general-global-menu-definer "window" "w"
                               "w" '(ace-window :wk "switch") ;; NOTE: You can also use 'SPC u SPC w w'
                               "W" '((lambda () (interactive) (ace-window 4)) :wk "swap")))

(general-global-menu-definer
 "window" "w"
 "c" '(whitespace-cleanup :wk "whitespace cleanup") ;; :(
 "h" '(evil-window-left     :wk "left")
 "j" '(evil-window-down     :wk "down")
 "k" '(evil-window-up       :wk "up")
 "l" '(evil-window-right    :wk "right")
 "v" '(evil-window-vsplit   :wk "vertical split")
 "s" '(evil-window-split    :wk "horizontal split")
 "d" '(evil-window-delete   :wk "close")
 "o" '(delete-other-windows :wk "close other"))

(use-package org
  :straight t)

(add-hook 'org-mode-hook 'auto-fill-mode)

(use-package htmlize
  :straight t)

(use-package ox-pandoc
  :straight t)

;(require 'ox-pandoc)

(require 'org-tempo)

(setq org-startup-folded t)

(general-mode-leader-definer 'org-mode-map
  ;; General
  "c" '(org-ctrl-c-ctrl-c     :wk "update")
  ;; Editing
  "'" '(org-edit-special     :wk "edit")
  "l" '(org-insert-link      :wk "insert link")
  ;; Navigation
  "o" '(org-open-at-point    :wk "open")
  ;; Search
  "." '(counsel-org-goto     :wk "goto")
  "/" '(counsel-org-goto-all :wk "goto all")
  ;; Deadlines
  "s" '(org-schedule         :wk "schedule")
  "d" '(org-deadline         :wk "deadline")
  ;; Tasks
  "t" '(org-todo             :wk "todo")
  "w" '(org-refile           :wk "refile"))
