.emacs.d/readme.org
** Babel
   First, let's ensure that =org-babel= handles indentation nicely.
   #+BEGIN_SRC emacs-lisp
     (setq org-edit-src-content-indentation 2)
     (setq org-src-tab-acts-natively t)
     (setq org-src-preserve-indentation nil)
   #+END_SRC

   It's a bit annoying that =org-babel= asks for confirmation all the time,
   so let's turn it off.

   #+BEGIN_SRC emacs-lisp
     (setq org-confirm-babel-evaluate nil)
   #+END_SRC

   Let's also add a hook to prevent =org-babel= from adding tabs.

   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook (lambda () (setq indent-tabs-mode nil)))
   #+END_SRC

   I also find the default window splitting for editing src blocks
   annoying, so let's change that.

   #+BEGIN_SRC emacs-lisp
     (setq org-src-window-setup 'other-window)
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-src-lang-modes '("inline-js" . javascript)) ;; js2 if you're fancy

     (defvar org-babel-default-header-args:inline-js
       '((:results . "html")
         (:exports . "results")))
     (defun org-babel-execute:inline-js (body _params)
       (format "<script type=\"text/javascript\">\n%s\n</script>" body))
   #+END_SRC

   I also _love_ to use gnuplot when working with literate org,
   especially when experimenting, so let's install that.

   #+BEGIN_SRC emacs-lisp
     (use-package gnuplot
       :straight t)
   #+END_SRC

   Now, =ob-haskell= has some... quirks. It really doesn't handle
   multi-line stuff very well. To fix this, we are going to do some
   wacky hacks.
   #+BEGIN_SRC emacs-lisp
     (advice-add 'org-babel-execute:haskell :override
                 (lambda (body params)
                   "Execute a block of Haskell code."
                   (require 'inf-haskell)
                   (add-hook 'inferior-haskell-hook
                             (lambda ()
                               (setq-local comint-prompt-regexp
                                           (concat haskell-prompt-regexp "\\|^λ?> "))))
                   (let* ((session (cdr (assq :session params)))
                          (result-type (cdr (assq :result-type params)))
                          (multi-line (string= "yes" (cdr (assq :multi-line params))))
                          (full-body (org-babel-expand-body:generic
                                      body params
                                      (org-babel-variable-assignments:haskell params)))
                          (session (org-babel-haskell-initiate-session session params))
                          (comint-preoutput-filter-functions
                           (cons 'ansi-color-filter-apply comint-preoutput-filter-functions))
                          (raw (org-babel-comint-with-output
                                   (session org-babel-haskell-eoe t full-body)
                                 (when multi-line
                                   (insert ":{")
                                   (comint-send-input nil t))
                                 (insert (org-trim full-body))
                                 (comint-send-input nil t)
                                 (when multi-line
                                   (insert ":}")
                                   (comint-send-input nil t))
                                 (insert org-babel-haskell-eoe)
                                 (comint-send-input nil t)))
                          (results (mapcar #'org-strip-quotes
                                           (cdr (member org-babel-haskell-eoe
                                                        (reverse (mapcar #'org-trim raw)))))))
                     (org-babel-reassemble-table
                      (let ((result
                             (pcase result-type
                               (`output (mapconcat #'identity (reverse (cdr results)) "\n"))
                               (`value (car results)))))
                        (org-babel-result-cond (cdr (assq :result-params params))
                          result (org-babel-script-escape result)))
                      (org-babel-pick-name (cdr (assq :colname-names params))
                                           (cdr (assq :colname-names params)))
                      (org-babel-pick-name (cdr (assq :rowname-names params))
                                           (cdr (assq :rowname-names params)))))))
   #+END_SRC

   Let's also let babel work for some other languages.

   #+BEGIN_SRC emacs-lisp
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((latex . t)
        (gnuplot . t)
        (shell . t)
        (sql . t)
        (haskell . t)
        (C       . t)))
   #+END_SRC

   Let's also bind

* Editor
** Alignment
   I often use ~align-regexp~, so let's bind that to something useful!
   #+BEGIN_SRC emacs-lisp
     (general-global-motion-definer
       "A" '(align-regexp :wk "align"))
   #+END_SRC

** Treemacs
   I use treemacs to view the structure of very large projects.
   #+BEGIN_SRC emacs-lisp
     (use-package treemacs
       :straight t
       :init
       (treemacs-resize-icons 14))
   #+END_SRC
** Projectile
   [[https://github.com/bbatsov/projectile][projectile]] is a project system for emacs, which lets find navigate
   our projects much faster.
   #+BEGIN_SRC emacs-lisp
     (use-package projectile
       :straight t)
   #+END_SRC

   To integrate =projectile= into our =ivy= based workflow, we are going to use
   [[https://github.com/ericdanan/counsel-projectile][counsel-projectile]].
   #+BEGIN_SRC emacs-lisp
     (use-package counsel-projectile
       :straight t)
   #+END_SRC

   Finally, let's enable =projectile-mode= globally, and bind the keymap.
   #+BEGIN_SRC emacs-lisp
     (projectile-mode 1)
     (counsel-projectile-mode 1)
   #+END_SRC

   Next, let's bind some keys!
   #+BEGIN_SRC emacs-lisp
     (global-definer
       "p" '(:keymap projectile-command-map :package projectile :wk "project"))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (general-global-menu-definer
      "search" "/"
      "p" '(projectile-ripgrep :wk "rg"))
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (defun counsel-projectile-switch-project-action-open-tab (project)
       "Open a new tab for PROJECT."
       (let ((projectile-switch-project-action
              (lambda ()
                (tab-new)
                (tab-rename project)
                (counsel-projectile-find-file))))
         (counsel-projectile-switch-project-by-name project)))


     (ivy-set-actions 'counsel-projectile-switch-project
                      '(("t" counsel-projectile-switch-project-action-open-tab "open in new tab")))

   #+END_SRC

   Lets integrate projectile with treemacs
   #+BEGIN_SRC emacs-lisp
     (use-package treemacs-projectile
       :straight t)
   #+END_SRC
** Autocompletion
   For autocompletion, we are going to use [[https://github.com/company-mode/company-mode][company-mode]].
   #+BEGIN_SRC emacs-lisp
     (use-package company
       :straight t
       :diminish company-mode
       :config
       (setq company-tooltip-align-annotations t
             company-idle-delay 0.3
             company-echo-delay 0
             company-dabbrev-downcase nil))
   #+END_SRC

   For now, let's enable it globally.
   #+BEGIN_SRC emacs-lisp
     (global-company-mode)
   #+END_SRC

   Start autocompletion when you press tab.
   #+BEGIN_SRC emacs-lisp
     (define-key company-mode-map (kbd "TAB") #'company-indent-or-complete-common)
   #+END_SRC

   I often use greek symbols, so this will be handy.
   #+BEGIN_SRC emacs-lisp
     (use-package company-math
       :straight t
       :config
       (add-to-list 'company-backends 'company-math-symbols-unicode))
   #+END_SRC

** AutoRevert
   =auto-revert-mode= reverts buffers when the underlying file on disk changes.
   #+BEGIN_SRC emacs-lisp
     (use-package autorevert
       :diminish auto-revert-mode
       :config
       (global-auto-revert-mode))
   #+END_SRC
** Errors
*** Flycheck
   Sometimes, =flymake= just won't cut it, so we have to fall back on =flycheck=.
   #+BEGIN_SRC emacs-lisp
     (use-package flycheck
       :straight t)
    #+END_SRC

    Let's also install =flycheck-posframe=.
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck-posframe
        :straight t
        :hook (flycheck-mode . flycheck-posframe-mode))
    #+END_SRC

    Let's also ensure that the =flycheck= error list buffer pops up at
    the bottom.
    #+BEGIN_SRC emacs-lisp
     (add-to-list 'display-buffer-alist
                  '("\\*Flycheck errors.*"
                    (display-buffer-below-selected display-buffer-at-bottom)
                    (inhibit-same-window . t)
                    (window-height . 15)))
    #+END_SRC
** Rainbow Parens
   Turn on [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]].
   #+BEGIN_SRC emacs-lisp
     (use-package rainbow-delimiters
       :straight t)
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
   #+END_SRC

** Grep
   I find it handy to be able to use =rg= to search for things.
   #+BEGIN_SRC emacs-lisp
     (use-package rg
       :straight t)
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (general-global-menu-definer
      "search" "/"
      "r" '(rg :wk "rg"))
   #+END_SRC
** Whitespace
   Let's highlight any funky looking whitespace.

   #+BEGIN_SRC emacs-lisp
     (setq whitespace-style '(face trailing empty tabs))
     (global-whitespace-mode)
     (diminish 'global-whitespace-mode)
   #+END_SRC
* Tools
** Nix and Direnv
   We need to use direnv and nix-sandbox to use nix shells
   #+BEGIN_SRC emacs-lisp
     (use-package direnv
       :straight t
       :config (direnv-mode))
     (use-package nix-sandbox
       :straight t)

     (setq default-nix-wrapper
           (lambda (args)
             (append (list "nix-shell" "--command")
                     (list (mapconcat 'identity args " ")))
             (list (nix-current-sandbox))))
   #+END_SRC
