.emacs.d/readme.el

(setq org-edit-src-content-indentation 2)
(setq org-src-tab-acts-natively t)
(setq org-src-preserve-indentation nil)

(setq org-confirm-babel-evaluate nil)

(add-hook 'org-mode-hook (lambda () (setq indent-tabs-mode nil)))

(setq org-src-window-setup 'other-window)

(add-to-list 'org-src-lang-modes '("inline-js" . javascript)) ;; js2 if you're fancy

(defvar org-babel-default-header-args:inline-js
  '((:results . "html")
    (:exports . "results")))
(defun org-babel-execute:inline-js (body _params)
  (format "<script type=\"text/javascript\">\n%s\n</script>" body))

(use-package gnuplot
  :straight t)

(advice-add 'org-babel-execute:haskell :override
            (lambda (body params)
              "Execute a block of Haskell code."
              (require 'inf-haskell)
              (add-hook 'inferior-haskell-hook
                        (lambda ()
                          (setq-local comint-prompt-regexp
                                      (concat haskell-prompt-regexp "\\|^λ?> "))))
              (let* ((session (cdr (assq :session params)))
                     (result-type (cdr (assq :result-type params)))
                     (multi-line (string= "yes" (cdr (assq :multi-line params))))
                     (full-body (org-babel-expand-body:generic
                                 body params
                                 (org-babel-variable-assignments:haskell params)))
                     (session (org-babel-haskell-initiate-session session params))
                     (comint-preoutput-filter-functions
                      (cons 'ansi-color-filter-apply comint-preoutput-filter-functions))
                     (raw (org-babel-comint-with-output
                              (session org-babel-haskell-eoe t full-body)
                            (when multi-line
                              (insert ":{")
                              (comint-send-input nil t))
                            (insert (org-trim full-body))
                            (comint-send-input nil t)
                            (when multi-line
                              (insert ":}")
                              (comint-send-input nil t))
                            (insert org-babel-haskell-eoe)
                            (comint-send-input nil t)))
                     (results (mapcar #'org-strip-quotes
                                      (cdr (member org-babel-haskell-eoe
                                                   (reverse (mapcar #'org-trim raw)))))))
                (org-babel-reassemble-table
                 (let ((result
                        (pcase result-type
                          (`output (mapconcat #'identity (reverse (cdr results)) "\n"))
                          (`value (car results)))))
                   (org-babel-result-cond (cdr (assq :result-params params))
                     result (org-babel-script-escape result)))
                 (org-babel-pick-name (cdr (assq :colname-names params))
                                      (cdr (assq :colname-names params)))
                 (org-babel-pick-name (cdr (assq :rowname-names params))
                                      (cdr (assq :rowname-names params)))))))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((latex . t)
   (gnuplot . t)
   (shell . t)
   (sql . t)
   (haskell . t)
   (C       . t)))

(general-global-motion-definer
  "A" '(align-regexp :wk "align"))

(use-package treemacs
  :straight t
  :init
  (treemacs-resize-icons 14))

(use-package projectile
  :straight t)

(use-package counsel-projectile
  :straight t)

(projectile-mode 1)
(counsel-projectile-mode 1)

(global-definer
  "p" '(:keymap projectile-command-map :package projectile :wk "project"))

(general-global-menu-definer
 "search" "/"
 "p" '(projectile-ripgrep :wk "rg"))

(defun counsel-projectile-switch-project-action-open-tab (project)
  "Open a new tab for PROJECT."
  (let ((projectile-switch-project-action
         (lambda ()
           (tab-new)
           (tab-rename project)
           (counsel-projectile-find-file))))
    (counsel-projectile-switch-project-by-name project)))


(ivy-set-actions 'counsel-projectile-switch-project
                 '(("t" counsel-projectile-switch-project-action-open-tab "open in new tab")))

(use-package treemacs-projectile
  :straight t)

(use-package company
  :straight t
  :diminish company-mode
  :config
  (setq company-tooltip-align-annotations t
        company-idle-delay 0.3
        company-echo-delay 0
        company-dabbrev-downcase nil))

(global-company-mode)

(define-key company-mode-map (kbd "TAB") #'company-indent-or-complete-common)

(use-package company-math
  :straight t
  :config
  (add-to-list 'company-backends 'company-math-symbols-unicode))

(use-package autorevert
  :diminish auto-revert-mode
  :config
  (global-auto-revert-mode))

(use-package flycheck
  :straight t)

(use-package flycheck-posframe
  :straight t
  :hook (flycheck-mode . flycheck-posframe-mode))

(add-to-list 'display-buffer-alist
             '("\\*Flycheck errors.*"
               (display-buffer-below-selected display-buffer-at-bottom)
               (inhibit-same-window . t)
               (window-height . 15)))

(use-package rainbow-delimiters
  :straight t)

(add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

(use-package rg
  :straight t)

(general-global-menu-definer
 "search" "/"
 "r" '(rg :wk "rg"))

(setq whitespace-style '(face trailing empty tabs))
(global-whitespace-mode)
(diminish 'global-whitespace-mode)

(use-package direnv
  :straight t
  :config (direnv-mode))
(use-package nix-sandbox
  :straight t)

(setq default-nix-wrapper
      (lambda (args)
        (append (list "nix-shell" "--command")
                (list (mapconcat 'identity args " ")))
        (list (nix-current-sandbox))))
