.emacs.d/readme.org
** Magit
   To start, let's install [[https://github.com/magit/magit][magit]].
   #+BEGIN_SRC emacs-lisp
     (use-package magit
       :straight t)
   #+END_SRC

   =magit= is a fantastic tool, but the keybindings don't quite line up with =evil=.
   Let's change that by using [[https://github.com/emacs-evil/evil-magit][evil-magit]].
   #+BEGIN_SRC emacs-lisp
     (use-package evil-magit
       :straight t)
   #+END_SRC

   Now, let's bind some keys!
   #+BEGIN_SRC emacs-lisp
     (general-global-menu-definer "git" "g")
     (general-global-git
       "b" '(magit-blame  :wk "blame")
       "g" '(magit-status :wk "status")
       "s" '(magit-status :wk "status"))
   #+END_SRC

   While we are here, let's add nice indicators for hunks by using [[https://github.com/syohex/emacs-git-gutter-fringe][git-gutter-fringe]].
   #+BEGIN_SRC emacs-lisp
     (use-package git-gutter-fringe
       :straight t
       :diminish git-gutter-mode
       :init
       ;; Hack for org mode
       (setq git-gutter:disabled-modes '(fundamental-mode image-mode pdf-view-mode))
       (git-gutter-mode)
       :config
       (general-global-git
         "h" '(git-gutter:stage-hunk :wk "stage hunk")))
   #+END_SRC

   =git-timemachine= lets us quickly browse through a repositories
   history, which is quite handy.
   #+BEGIN_SRC emacs-lisp
          (use-package git-timemachine
            :straight t
            :init
            (evil-collection-init 'git-timemachine)
            (general-global-git
              "t" '(git-timemachine :wk "timemachine")))
   #+END_SRC

   =magit-todos= lets us see all of the TODOS we have listed in our repositories.
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package magit-todos
       :straight t
       :after magit
       :init
       (magit-todos-mode))
   #+END_SRC
*** Ediff
    By default, =ediff= has some odd defaults. Let's change that
    #+BEGIN_SRC emacs-lisp
      (use-package ediff
        :defer t
        :config
        ;; Disable whitespace checking
        (setq ediff-diff-options "w")
        (setq ediff-split-window-function #'split-window-vertically
              ediff-window-setup-function #'ediff-setup-windows-plain))
    #+END_SRC
** GPG
   Enable prompting for GPG pins.
   #+BEGIN_SRC emacs-lisp
     (setq epa-pinentry-mode 'loopback)
   #+END_SRC
** EShell
   #+BEGIN_SRC emacs-lisp
     (general-global-menu-definer "open" "o"
                                  "e" '(eshell :wk "eshell"))
   #+END_SRC

   Next, let's create a function that toggles auto scrolling.
   #+BEGIN_SRC emacs-lisp
     (defun eshell-toggle-auto-scroll ()
       (interactive)
       (setq eshell-scroll-to-bottom-on-input (not eshell-scroll-to-bottom-on-input)))
   #+END_SRC

   Now, let's add some helpful motion keys.
   #+BEGIN_SRC emacs-lisp
     (general-local-motion-definer
      'eshell-mode-map
      "j" 'eshell-next-input
      "k" 'eshell-previous-input)
   #+END_SRC

** Blog Exporting
   The following snippet taken from [[https://emacs.stackexchange.com/questions/22476/how-can-i-use-ox-pandoc-as-a-publishing-backend-for-org-files][this stackoverflow answer]]:
   #+begin_src emacs-lisp
      (defun org-pandoc-html5-filter (contents _backend _info)
       "Convert Org CONTENTS into html5 output."
       (let ((backup-inhibited t)
         contents-filename
         process
         buffer)
         (unwind-protect
         ;; org-pandoc runs pandoc asynchronous.  We need to
         ;; synchronize pandoc for filtering.  `org-pandoc-run' returns
         ;; the process needed for synchronization.  Pityingly we need
         ;; to call `org-pandoc-run-to-buffer-or-file' which handles
         ;; additional options and special hooks.  Therefore we
         ;; temporarily advice `org-pandoc-run' to give us the process.
         (cl-letf* ((original-org-pandoc-run (symbol-function 'org-pandoc-run))
                ((symbol-function 'org-pandoc-run) (lambda (&rest a)
                                 (setq process (apply original-org-pandoc-run a)))))
           (setq contents-filename (make-temp-file ".tmp" nil ".org" contents))
           (org-pandoc-run-to-buffer-or-file
            contents-filename
            'html5
            nil ;; not only the sub-tree
            t) ;; buffer
           (while (process-live-p process)
             (sit-for 0.5))
           (with-current-buffer (setq buffer (process-buffer process))
             (buffer-string)))
           (when (file-exists-p contents-filename)
         (delete-file contents-filename))
           (when (buffer-live-p buffer)
         (kill-buffer buffer))
           )))

     (org-export-define-derived-backend
         'pandoc-html5
         'pandoc
       :filters-alist '((:filter-final-output . org-pandoc-html5-filter)))

     (defun org-pandoc-publish-to-html (plist filename pub-dir)
       "Publish an org file to html using ox-pandoc. Return output file name."
       (let ((org-pandoc-format "html5"))
         (org-publish-org-to
          'pandoc-html5
          filename
          (concat "." (or (plist-get plist :html-extension)
                  org-html-extension
                  "html"))
          plist
          pub-dir)))
   #+end_src

   #+begin_src emacs-lisp
     (defun convert-post (src-path)
       (let* ((space " ")
              (name (f-base src-path))
              (target-path (concat "/home/solomon/.org/blog/build/" name "/"))
              (title (concat "--metadata title=\"" (s-titleized-words (substring name 10)) "\""))
              (template "--template=/home/solomon/.org/blog/template.html")
              (cmd (concat "pandoc"
                           space
                           src-path
                           space
                           template
                           space
                           "-f org -t html5 -s -o"
                           space
                           target-path
                           "index.html"
                           space
                           title)))
         (f-mkdir target-path)
         (shell-command cmd)
         ))

     (defun build-blog-posts ()
       (interactive)
       (let ((posts (f-entries "~/.org/blog/org")))
         (mapc 'convert-post posts)
         (shell-command "rsync -r --delete ~/.org/blog/build/ cofree.coffee:/srv/www/blog.cofree.coffee")
         ))
   #+end_src
* LSP
  [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]] provides language services for quite a few languages.
  #+BEGIN_SRC emacs-lisp
    (use-package lsp-mode
      :straight t
      :commands lsp
      :init
      (general-local-motion-definer
       'lsp-mode-map
       "d" 'lsp-find-definition
       "I" 'lsp-find-implementation
       "R" 'lsp-find-references
       "D" 'xref-pop-marker-stack)
      (general-define-key
       :states 'normal
       :keymaps 'lsp-mode-map
       "K" 'lsp-describe-thing-at-point))
  #+END_SRC

  Let's also ensure that the lsp help buffer pops up at the bottom.
  #+BEGIN_SRC emacs-lisp
    (add-to-list 'display-buffer-alist
                 '("\\*lsp-help\\*"
                   (display-buffer-below-selected display-buffer-at-bottom)
                   (inhibit-same-window . t)
                   (window-height . 15)))
  #+END_SRC


  Next, let's add [[https://github.com/tigersoldier/company-lsp][company-lsp]] for autocompletion support.
  #+BEGIN_SRC emacs-lisp
    (use-package company-lsp
      :straight t
      :commands company-lsp)
  #+END_SRC

  Once that's installed, we have to register it as a company backend.
  #+BEGIN_SRC emacs-lisp
    (require 'company-lsp)
    (push 'company-lsp company-backend)
  #+END_SRC

  Next, it's a bit of a pain having to manually set + unset ~lsp-log-io~, so
  let's write a little helper.
  #+BEGIN_SRC emacs-lisp
    (defun lsp-toggle-log-io ()
      "Toggle `lsp-log-io'"
      (interactive)
      (if lsp-log-io
          (setq lsp-log-io nil)
        (setq lsp-log-io t))
      (if lsp-print-performance
          (setq lsp-print-performance t)
        (setq lsp-print-performance nil)))
  #+END_SRC

  Let's also setup =dap-mode=.
  #+BEGIN_SRC emacs-lisp
    (use-package dap-mode;
      :straight t)
   #+END_SRC

   Let's also add =lsp-treemacs=
   #+BEGIN_SRC emacs-lisp
     (use-package lsp-treemacs
       :straight t)
   #+END_SRC
* Languages
** General Programming
   Lets use smart parens to slurp and barf

   #+begin_src emacs-lisp
     (general-define-key
      :keymaps 'prog-mode-map
      "C-(" 'sp-forward-barf-sexp
      "C-)" 'sp-forward-slurp-sexp)
   #+end_src
