.emacs.d/readme.org
** Haskell
   First, let's install =haskell-mode=. This provides syntax
   highlighting and repl interaction.


   #+BEGIN_SRC emacs-lisp
     (use-package haskell-mode
       :straight t
       :init
       (add-hook 'haskell-mode-hook 'interactive-haskell-mode)
       (add-hook 'haskell-mode-hook 'haskell-decl-scan-mode)
       (add-hook 'haskell-mode-hook (lambda () (flycheck-mode -1)))
       :config
       ;(setq haskell-nix-wrapper
       ;      (lambda (args)
       ;        (apply default-nix-wrapper (list (append args (list "--ghc-option" "-Wwarn"))))))

       ;(setq haskell-process-wrapper-function haskell-nix-wrapper)

       (setq haskell-process-wrapper-function
             (lambda (args) (apply 'nix-shell-command (nix-current-sandbox) args)))

       (setq haskell-font-lock-symbols t)
       (setq haskell-process-use-presentation-mode t)
       (setq haskell-ghci-options
             '("-ferror-spans"
               "-fdefer-typed-holes"
               "-fno-max-relevant-binds"
               "-fno-diagnostics-show-caret"
               "-fno-show-valid-hole-fits"
               "-fobject-code"
               "-fbyte-code"))
       (setq haskell-process-args-cabal-new-repl
             (mapcar (lambda (opt) (concat "--repl-options=" opt)) haskell-ghci-options))
       (setq haskell-process-args-stack-ghci
             (list (concat "--ghci-options=" (string-join haskell-ghci-options " "))
                   "--no-build"
                   "--no-load"))
       (setq haskell-process-args-ghci haskell-ghci-options)
       (setq haskell-process-auto-import-loaded-modules t)
       (setq haskell-font-lock-symbols-alist
             '(("\\" . "λ")
               ("." "∘" haskell-font-lock-dot-is-not-composition)
               ("forall" . "∀")))
       (setq haskell-interactive-popup-errors nil)

       (setq haskell-indentation-left-offset 4)
       (setq haskell-indentation-layout-offset 4))
       ;(push '("*Haskell Presentation*" :height 20 :position bottom) popwin:special-display-config))
   #+END_SRC


   Next, let's add agda-like refinement for holes.
   #+BEGIN_SRC emacs-lisp :tangle no
     (defun haskell-refine-hole ()
       (interactive)
       (overlay-get (car (overlays-at (point))) 'haskell-hole))
   #+END_SRC

   Send the currently selected region to the interactive buffer.
   #+BEGIN_SRC emacs-lisp
     (defun haskell-interactive-send-command (cmd)
       (haskell-interactive-mode-set-prompt cmd)
       (with-current-buffer (haskell-session-interactive-buffer (haskell-interactive-session))
         (haskell-interactive-handle-expr)))

     (defun haskell-interactive-send-region ()
       "Copy the current line to the prompt, overwriting the current prompt."
       (interactive)
       (let ((l (buffer-substring-no-properties (region-beginning)
                                                (region-end))))
         ;; If it looks like the prompt is at the start of the line, chop
         ;; it off.
         (when (and (>= (length l) (length haskell-interactive-prompt))
                    (string= (substring l 0 (length haskell-interactive-prompt))
                             haskell-interactive-prompt))
           (setq l (substring l (length haskell-interactive-prompt))))

         (haskell-interactive-send-command l)))
   #+END_SRC

   Let's ensure that binaries installed via cabal are on our path.
   #+BEGIN_SRC emacs-lisp
     (add-to-path (expand-file-name "~/.cabal/bin/"))
     (add-to-path (expand-file-name "~/.local/bin/"))
   #+END_SRC

   Finally, let's bind some keys
   #+BEGIN_SRC emacs-lisp
     (general-mode-leader-definer 'haskell-mode-map
       "?" '(haskell-hoogle                :wk "hoogle")
       "s" '(haskell-interactive-switch    :wk "switch to interactive")
       "i" '(haskell-process-do-info       :wk "info")
       "t" '(haskell-mode-show-type-at     :wk "type")
       "l" '(haskell-process-load-file     :wk "load")
       "r" '(haskell-process-reload        :wk "reload")
       "T" '(haskell-session-change-target :wk "change target")
       "R" '(haskell-process-restart       :wk "restart process"))

     (general-local-motion-definer 'haskell-mode-map
       "k" '(beginning-of-defun :wk "top of definition")
       "j" '(end-of-defun :wk "bottom of definition")
       "d" '(haskell-mode-goto-loc :wk "goto definition"))

     (general-define-key
      :states 'visual
      :keymaps 'haskell-mode-map
      "e" 'haskell-interactive-send-region)

     (general-mode-leader-definer 'haskell-interactive-mode-map
       "s" '(haskell-interactive-switch-back :wk "switch to source"))

     (general-local-motion-definer
      'haskell-interactive-mode-map
      "j" 'haskell-interactive-mode-prompt-next
      "k" 'haskell-interactive-mode-prompt-previous)
   #+END_SRC

   Let's make it so that the haskell presentation buffer supports vim keybindings.
   #+BEGIN_SRC emacs-lisp
     (evil-collection-define-key 'normal 'haskell-presentation-mode-map
       "q" 'quit-window
       "c" 'haskell-presentation-clear)
   #+END_SRC

** Idris
   Lets install Idris Mode and use direnv to load the nix shell

   #+BEGIN_SRC emacs-lisp
     (use-package idris-mode
       :straight t
       :init
       (add-hook 'idris-mode-hook 'direnv-mode)
       ;(add-to-list 'display-buffer-alist
       ;             '("\\*idris-holes*"
       ;               (display-buffer-below-selected display-buffer-at-bottom)
       ;               (inhibit-same-window . t)
       ;               (window-height . 15)))
       ;(add-to-list 'display-buffer-alist
       ;             '("\\*idris-notes*"
       ;               (display-buffer-below-selected display-buffer-at-bottom)
       ;               (inhibit-same-window . t)
       ;               (window-height . 15)))
       )
   #+END_SRC

   Now let's bind some keys
   #+BEGIN_SRC emacs-lisp
     (general-mode-leader-definer 'idris-mode-map
       "c" '(idris-case-split              :wk "case split")
       "d" '(idris-add-clause              :wk "add clause")
       "D" '(idris-docs-at-point           :wk "docs at point")
       "l" '(idris-make-lemma              :wk "make lemma")
       "p" '(idris-proof-search            :wk "proof search")
       "r" '(idris-load-file               :wk "load file")
       "t" '(idris-type-at-point           :wk "type at point")
       "T" '(idris-type-search             :wk "type search")
       "w" '(idris-make-with-block         :wk "add with block"))
      (general-def idris-hole-list-mode-map
        "q" 'kill-buffer-and-window)
   #+END_SRC
** Agda
   First, we need to load the agda-input package. This provides an input method for writing agda code.
   #+begin_src emacs-lisp
     (use-package agda-input
       :straight (agda-input :type git :host github :repo "agda/agda"
                             :branch "release-2.6.0.1"
                             :files ("src/data/emacs-mode/agda-input.el")))
   #+end_src

Now, let’s load up agda2-mode itself.

#+begin_src emacs-lisp
  (use-package agda2-mode
    :straight (agda2-mode :type git :host github
                          :repo "agda/agda"
                          :branch "release-2.6.0.1"
                          :files ("src/data/emacs-mode/*.el"
                                  (:exclude "agda-input.el"))))
#+end_src

Next, lets add a file template for agda files.

#+begin_src emacs-lisp
  ;(create-file-template ".*.agda$" "cubical-agda-template" 'agda2-mode)
#+end_src
*** Keybindings
First, let’s add the mode keybindings.

#+begin_src emacs-lisp
  (general-mode-leader-definer 'agda2-mode-map
    "l" '(agda2-load   :wk "load")
    "r" '(agda2-refine :wk "refine"))
#+end_src

Next, let’s set up the jump handler.

#+begin_src emacs-lisp
  (general-local-motion-definer
   'agda2-mode-map
   "j" 'agda2-next-goal
   "k" 'agda2-previous-goal
   "d" 'agda2-goto-definition-keyboard)
#+end_src
** Nix
   First, let's install =nix-mode=.
   #+BEGIN_SRC emacs-lisp
     (use-package nix-mode
       :straight t
       :init (add-hook 'nix-mode 'direnv-mode))
   #+END_SRC
** YAML
   #+BEGIN_SRC emacs-lisp
     (use-package yaml-mode
       :straight t)
   #+END_SRC

** Go
   Lets install go-mode

   #+begin_src emacs-lisp
     (use-package go-mode
       :straight t
       )

   #+end_src
